### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [581]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [582]:
df = pd.DataFrame(purchase_data)

In [583]:
df.dtypes

Purchase ID      int64
SN              object
Age              int64
Gender          object
Item ID          int64
Item Name       object
Price          float64
dtype: object

## Player Count

* Display the total number of players

In [584]:
total_players = purchase_data["SN"].count()
total_players

780

In [585]:
male_player_df = df[df['Gender']=="Male"]
male_total = len(male_player_df['SN'].unique())
male_total

484

In [586]:
male_player_df2 = df[df['Gender']=="Male"]
male_total2 = (male_player_df['Price'].sum())
male_total2

1967.64

In [587]:
Female_player_df = df[df['Gender']=="Female"]
Female_total = len(Female_player_df['SN'].unique())
Female_total

81

In [588]:
Female_player_df2 = df[df['Gender']=="Male"]
Female_total2 = (Female_player_df['Price'].sum())
Female_total2

361.94

In [589]:
Other_NonDisclosed_df = df[df['Gender']== "Other / Non-Disclosed"]
Other_NonDisclosed  = (Other_NonDisclosed_df['Price'].sum())
Other_NonDisclosed

50.19

In [590]:
Other_NonDisclosed_df2 = df[df['Gender']== "Other / Non-Disclosed"]
Other_NonDisclosed2  = len(Other_NonDisclosed_df['SN'].unique())
Other_NonDisclosed2

11

In [591]:
 male_total, Female_total, Other_NonDisclosed2
 male_total, Female_total, Other_NonDisclosed2

(484, 81, 11)

In [592]:
frame_df = pd.DataFrame({
    "Gender_": [male_total, Female_total, Other_NonDisclosed2],
    "Count": [male_total2, Female_total2, Other_NonDisclosed]})
   
frame_df

   Gender_    Count
0      484  1967.64
1       81   361.94
2       11    50.19

In [593]:
Purchase_Count = df["Price"].value_counts()

In [594]:
Purchase_Per_Item = frame_df["Count"]/frame_df["Gender_"]

Purchase_Per_Item

0    4.065372
1    4.468395
2    4.562727
dtype: float64

In [595]:
Purchase_Per_Item_Form = Purchase_Per_Item
Purchase_Per_Item_Form= Purchase_Per_Item_Form.map("${:,.2f}".format)
Purchase_Per_Item_Form = pd.DataFrame(Purchase_Per_Item_Form)
Purchase_Per_Item_Form

       0
0  $4.07
1  $4.47
2  $4.56

In [600]:
Table = pd.DataFrame({ "Gender_" : ["Male","Female","Other"], "Gender_Count" : [484,81,11], "Gender Purchase Total": ["$1967.64","$361.94", "$50.19"]})
Table.head()

  Gender_  Gender_Count Gender Purchase Total
0    Male           484              $1967.64
1  Female            81               $361.94
2   Other            11                $50.19

In [601]:
Purchase_Total_Gender = Gender_Groupby["Price"].sum()

In [602]:
avg_price = df['Price'].mean()

In [603]:
avg_price_form = avg_price
avg_price_form = '${:,.2f}'.format(avg_price_form)
avg_price_form

'$3.05'

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [604]:
Item_Groupby = df.groupby(['Item ID'])
Item_Groupby

In [605]:
Item_ID = purchase_data["Item ID"].value_counts()
Total_Item_ID = Item_ID.count()
Total_Item_ID

183

In [611]:
Itemd = Item_Groupby["Price"].value_counts()

In [607]:
Gender_Groupby = df.groupby(["Gender"])
Gender_Groupby

In [608]:
Gender_Purchase_Count = (Gender_Groupby['Gender'].count())
Gender_Purchase_Count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [616]:
Gender_Sumcount = df["Gender"].count()
Gender_Sumcount

780

In [618]:
Total_Purchase = df["Price"].sum()
Total_Purchase

2379.77

In [620]:
Total_Purchase_Form = Total_Purchase
Total_Purchase_Form = '${:,.2f}'.format(Total_Purchase_Form)
Total_Purchase_Form

'$2,379.77'

##

In [622]:
Purchasing_Analysis_Total  = pd.DataFrame([{"avg_price" : avg_price_form, "Total Purchases": Total_Purchase_Form ," Total Players" : total_players , "Unique Items Count" : Total_Item_ID}])
Purchasing_Analysis_Total

    Total Players Total Purchases  Unique Items Count avg_price
0             780       $2,379.77                 183     $3.05

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [623]:
IndexC = df.set_index("Gender")

In [624]:
Purchase_Total_Gender = Gender_Groupby["Price"].sum()

In [625]:
Percentage_Gender =Gender_Purchase_Count/total_players

In [626]:
Percentage_Gender_Form = Percentage_Gender
Percentage_Gender_Form = 100 * Percentage_Gender_Form
Percentage_Gender_Form = Percentage_Gender_Form.round(2).astype(str) + '%'
Percentage_Gender_Form

Gender
Female                   14.49%
Male                     83.59%
Other / Non-Disclosed     1.92%
Name: Gender, dtype: object

In [627]:
Purchasing_Analysis_Total = pd.DataFrame({'Count' : Gender_Purchase_Count, "Percentage" : Percentage_Gender_Form})
Purchasing_Analysis_Total

                       Count Percentage
Gender
Female                   113     14.49%
Male                     652     83.59%
Other / Non-Disclosed     15      1.92%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [628]:
Avg_Price_Gender = Purchase_Total_Gender / Gender_Purchase_Count

In [629]:
Purchase_Total_Gender_Form = Purchase_Total_Gender
Purchase_Total_Gender_Form = Purchase_Total_Gender_Form.map("${:,.2f}".format)
Purchase_Total_Gender_Form

Gender
Female                     $361.94
Male                     $1,967.64
Other / Non-Disclosed       $50.19
Name: Price, dtype: object

In [630]:
Avg_Price_Gender_Form = Avg_Price_Gender
Avg_Price_Gender_Form = Avg_Price_Gender_Form.map("${:,.2f}".format)
Avg_Price_Gender_Form

Gender
Female                   $3.20
Male                     $3.02
Other / Non-Disclosed    $3.35
dtype: object

In [631]:
Index_Buyer = df.set_index('SN')

In [632]:
Names = df["SN"].value_counts()

In [633]:
Names_Groupby = df.groupby(["SN"])
Names_Groupby

In [634]:
Total_Price_Names = Names_Groupby["Price"].sum()

In [635]:
Total_Price_Names_Form = Total_Price_Names
Total_Price_Names_Form = Total_Price_Names_Form.map("${:,.2f}".format)
Total_Price_Names_Form.head()

SN
Adairialis76    $2.28
Adastirin33     $4.48
Aeda94          $4.91
Aela59          $4.32
Aelaria33       $1.79
Name: Price, dtype: object

In [636]:
Names_avg = Total_Price_Names / Names

In [637]:
Names_avg_Form = Names_avg
Names_avg_Form = Names_avg_Form.map("${:,.2f}".format)
Names_avg_Form.head()

Adairialis76    $2.28
Adastirin33     $4.48
Aeda94          $4.91
Aela59          $4.32
Aelaria33       $1.79
dtype: object

In [638]:
Purchasing_Analysis_Gender = pd.DataFrame({'Purchase Count' :Gender_Purchase_Count, "Total Purchases by Gender" : Purchase_Total_Gender_Form, "Average Price": Avg_Price_Gender_Form})

Purchasing_Analysis_Gender

                       Purchase Count Total Purchases by Gender Average Price
Gender
Female                            113                   $361.94         $3.20
Male                              652                 $1,967.64         $3.02
Other / Non-Disclosed              15                    $50.19         $3.35

In [639]:
Purchase_Prices_Dataframe = pd.DataFrame({'Buyer_Names_Count' : Names, "Purchase_Value_Names" : Total_Price_Names_Form, "Avg_Purchase_Amount" : Names_avg_Form})

In [640]:
Purchase_Prices_Dataframe2 = pd.DataFrame({"Gender": Gender_Purchase_Count, "Purchase_Value_Names" : Total_Price_Names_Form, "Avg_Purchase_Amount" : Names_avg_Form})

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [641]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [642]:
print(df['Age'].max())
print(df['Age'].min())

45
7

In [643]:
df['Age Group'] = pd.cut(df['Age'], bins, labels = Group_Labels)

In [644]:
bins = [0,9,19,29,39,49]

Group_Labels = ['0 to 9', '10 to 19', '20 to 29' , '30 to 39', '40 to 49', ]

In [645]:
pd.cut(df['Age'], bins, labels = Group_Labels).head()

0    20 to 29
1    40 to 49
2    20 to 29
3    20 to 29
4    20 to 29
Name: Age, dtype: category
Categories (5, object): [0 to 9 < 10 to 19 < 20 to 29 < 30 to 39 < 40 to 49]

In [646]:
bin_Group = df.groupby('Age Group')
bin_Group

In [647]:
Bin_Group_Form = (bin_Group['Age Group'].count())

In [648]:
df_count = df['Age Group'].count()
df_count

780

In [649]:
df_count_group = df['Age Group'].value_counts()
df_count_group.head()

20 to 29    466
10 to 19    164
30 to 39    114
0 to 9       23
40 to 49     13
Name: Age Group, dtype: int64

In [650]:
Age_Percentage = Bin_Group_Form/df_count
Age_Percentage = Age_Percentage * 100
Age_Percentage

Age Group
0 to 9       2.948718
10 to 19    21.025641
20 to 29    59.743590
30 to 39    14.615385
40 to 49     1.666667
Name: Age Group, dtype: float64

In [651]:
Age_Percentage_Form = Age_Percentage
Age_Percentage_Form = Age_Percentage_Form.round(2).astype(str) + '%'
Age_Percentage_Form

Age Group
0 to 9       2.95%
10 to 19    21.03%
20 to 29    59.74%
30 to 39    14.62%
40 to 49     1.67%
Name: Age Group, dtype: object

In [652]:
Age_Demographics_Dataframe = pd.DataFrame({"Count by Age": Bin_Group_Form, "Age Percentage" : Age_Percentage_Form})
Age_Demographics_Dataframe

           Count by Age Age Percentage
Age Group
0 to 9               23          2.95%
10 to 19            164         21.03%
20 to 29            466         59.74%
30 to 39            114         14.62%
40 to 49             13          1.67%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [653]:
Age_Purchase_Groupby = df.groupby(['Price'])
Age_Purchase_Groupby

In [654]:
Age_Purchase_Total = bin_Group['Price'].sum()

In [655]:
d = bin_Group["Price"].mean()
d

Age Group
0 to 9      3.353478
10 to 19    3.022378
20 to 29    3.019442
30 to 39    3.172544
40 to 49    2.941538
Name: Price, dtype: float64

In [656]:
Age_Purchase_Total_Form = Age_Purchase_Total
Age_Purchase_Total_Form = Age_Purchase_Total_Form.map("${:,.2f}".format)
Age_Purchase_Total_Form

Age Group
0 to 9         $77.13
10 to 19      $495.67
20 to 29    $1,407.06
30 to 39      $361.67
40 to 49       $38.24
Name: Price, dtype: object

In [657]:
Avg_Age_Purchase_Total = Age_Purchase_Total/df_count_group

In [658]:
Avg_Age_Purchase_Total_Form = Avg_Age_Purchase_Total
Avg_Age_Purchase_Total_Form = Avg_Age_Purchase_Total_Form.map("${:,.2f}".format)
Avg_Age_Purchase_Total_Form.head()

0 to 9      $3.35
10 to 19    $3.02
20 to 29    $3.02
30 to 39    $3.17
40 to 49    $2.94
dtype: object

In [659]:
Avg_Purchasecount_Age = Items_Age.count()/d
Avg_Purchasecount_Age.head()

Age Group
0 to 9      1.490989
10 to 19    1.654326
20 to 29    1.655935
30 to 39    1.576022
40 to 49    1.699791
Name: Price, dtype: float64

In [660]:
Purchasing_Analysis_Age_Dataframe = pd.DataFrame({"Count by Age" :Bin_Group_Form, "Average Purchase Price": Avg_Age_Purchase_Total_Form, "Total Purchase Price" : Age_Purchase_Total_Form })
Purchasing_Analysis_Age_Dataframe

          Count by Age Average Purchase Price Total Purchase Price
0 to 9              23                  $3.35               $77.13
10 to 19           164                  $3.02              $495.67
20 to 29           466                  $3.02            $1,407.06
30 to 39           114                  $3.17              $361.67
40 to 49            13                  $2.94               $38.24

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [661]:
Popular_Items = pd.DataFrame(purchase_data[["Item ID", "Item Name", "Price"]])
Popular_Items.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [662]:
Index_PopItems = Popular_Items.set_index("Item ID")

In [663]:
Total_Purchase_Per_Item = (Popular_Items.groupby(["Item ID"])).sum()

Total_Purchase_Per_Item.head()

         Price
Item ID
0         5.12
1         9.78
2        14.88
3        14.94
4         8.50

In [664]:
merge_table = pd.merge( Popular_Items, Total_Purchase_Per_Item)
merge_table.head()

   Item ID                     Item Name  Price
0      136  Ghastly Adamantite Protector   3.58
1      136  Ghastly Adamantite Protector   3.58
2      136  Ghastly Adamantite Protector   3.58
3      136  Ghastly Adamantite Protector   3.58
4      136  Ghastly Adamantite Protector   3.58

In [667]:
Merge_Sort = merge_table.sort_values('Price', ascending=False)
Merge_Sort.head()

    Item ID Item Name  Price
8        82   Nirvana    4.9
10       82   Nirvana    4.9
15       82   Nirvana    4.9
14       82   Nirvana    4.9
13       82   Nirvana    4.9

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [665]:
ls = df.sort_values('Price', ascending=False)
ls.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
554,554,Dyally87,22,Male,63,Stormfury Mace,4.99,20 to 29
189,189,Hiasri33,23,Male,63,Stormfury Mace,4.99,20 to 29
110,110,Ririp86,25,Male,139,"Mercy, Katana of Dismay",4.94,20 to 29
246,246,Lirtilsa71,24,Male,139,"Mercy, Katana of Dismay",4.94,20 to 29
493,493,Chanirrasta87,14,Male,139,"Mercy, Katana of Dismay",4.94,10 to 19